app/Http/Controllers/Settings/SettingsController.php

UPDATE `settings` SET `title` = 'test11', `value` = '{\\"ar\\":\\"[\\\\u0634\\\\u064a\\\\u0628\\\\u0628\\\\u064a\\",\\"en\\":\\"test\\"}', `is_developer` = 1, `settings`.`updated_at` = '2022-07-18 10:06:53' WHERE `id` = 2
---
    public function update(StoreSettingRequest $request, Setting $setting)
    {
        DB::beginTransaction();
        try {
            $value="";
            if($request->type=='multi-select' && gettype($request->value)=='array'){
                $value=implode(',',$request->value);
            }else{
                $value=$request->value;
            }
            $setting->value=$value;
            $setting->save();