app/Http/Controllers/Country/CountryController.php

    public function store(StoreCountryRequest $request)
    {

        $country = new Country();
        $dataTranslatable = (array)json_decode($request->name);
        $country->name = ($dataTranslatable);
        $country->iso_code_1 = $request->iso_code_1;
        $country->iso_code_2 = $request->iso_code_2;
        $country->phone_code = $request->phone_code;
        $country->flag = $request->flag;
        if ($request->hasFile('flag')) {
            $country->flag = $this->imageUpload($request->file('flag'), $this->imagesPath['images']);
        }
        if (!$country->save())
---
INSERT INTO `countries` (`name`, `iso_code_1`, `iso_code_2`, `phone_code`, `flag`, `updated_at`, `created_at`) VALUES ('{\\"en\\":{\\"en\\":\\"testCountry\\",\\"ar\\":\\"sdsd\\"}}', '120', '300', '+52', 'countries/images/62d53d9ac127f_twil-can.jpg', '2022-07-18 11:01:47', '2022-07-18 11:01:47')